% 定义目标函数系数（需线性化处理）
f = [-0.25, -0.15, -0.20, -0.10, -0.30]; % 对应A,B,C,D,E的系数
%TODO f换成我们的A B C D E 

% 定义不等式约束矩阵 A*x <= b
% TODO 改为使用面向问题的求解
%决策变量（向量x）:T:旅游人数（百万人/年） H酒店税 S ship 每日船只数量   I 环保投资 G gov 旅游业拨款
A = [
    0, 0, 1, 0, 0;        % S <= 200  %每日船只数量 --  
    %TODO 根据资料修改b(1) : //10
    0, 0, -1, 0, 0;       % I >= 5 → -I <= -5    %百万美元每年 5百万是不是少了，美国也不穷啊
    0.02, 0.01, 0, 0, 0;  % 0.02T + 0.01H <= 0.4   %基尼指数
    -0.5, 0, -0.3, -1, 0; % -0.5T -0.3G -U <= -50
    -0.05, 0, -0.1, 0, 0; % -0.05T -0.1G <= -0.7
    -0.8, -0.05, 0, 0, 0; % -0.8T -0.05H <= -300 (假设H=10)
    0.1, 0, -0.02, 0, 0;  % 0.1T -0.02G <= 5
    0, 0, 1, 1, 0         % G + I <= 50
];
%TODO: x 是要确定的指标：之后可扩展。扩展了指标再相应扩展 A b 即可。 
b = [200; -5; 0.4; -50; -0.7; -300; 5; 50];

% 定义变量上下界
lb = [0, 0, 0, 0, 0];     % 所有变量（向量x的各个分量）非负
ub = [Inf, Inf, 200, 50, Inf]; % 所有变量（向量x的各个分量）的上限。 Inf --- 正无穷

% 求解线性规划
[x, fval] = linprog(f, A, b, [], [], lb, ub);
%1st arg: 目标函数  2nd arg: 系数矩阵A 3rd arg 不等式（<=）右边的值组成的向量b 
%末尾两个arg： 决策变量的上下限制




% 输出结果 反映出决策变量（向量x）:T H S I G
disp('最优解：');
disp(['旅游人数 T = ', num2str(x(1)), ' 百万人/年']); % 向量x的长度 & 索引 correct
disp(['酒店税 H = ', num2str(x(2)), '%']); % 单位correct
disp(['船只数量 S = ', num2str(x(3)), ' 艘/天']); %单位correct
disp(['环保投资 I = ', num2str(x(4)), ' 百万美元/年']);
disp(['旅游业拨款 G = ', num2str(x(5)), ' 百万美元/年']);
disp(['最大STI = ', num2str(-fval)]);